nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1180/edgefast_bluetooth_examples/a2dp_sink/cm33/pin_mux.h
/*
 * Copyright 2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);          /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitM2UARTPins(void);              /* Function assigned for the Cortex-M33 */

/* GPIO_AD_07 (coord T17), SDIO_RST */
/* Routed pin properties */
#define BOARD_INITPINSM2_SDIO_RST_PERIPHERAL                              RGPIO4   /*!< Peripheral name */
#define BOARD_INITPINSM2_SDIO_RST_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINSM2_SDIO_RST_CHANNEL                                     7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINSM2_SDIO_RST_GPIO                                    RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINSM2_SDIO_RST_GPIO_PIN                                    7U   /*!< GPIO pin number */
#define BOARD_INITPINSM2_SDIO_RST_GPIO_PIN_MASK                       (1U << 7U)   /*!< GPIO pin mask */

/* GPIO_AD_17 (coord M17), WL_RST */
/* Routed pin properties */
#define BOARD_INITPINSM2_WL_RST_PERIPHERAL                                RGPIO4   /*!< Peripheral name */
#define BOARD_INITPINSM2_WL_RST_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINSM2_WL_RST_CHANNEL                                      17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINSM2_WL_RST_GPIO                                      RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINSM2_WL_RST_GPIO_PIN                                     17U   /*!< GPIO pin number */
#define BOARD_INITPINSM2_WL_RST_GPIO_PIN_MASK                        (1U << 17U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinsM2(void);                  /* Function assigned for the Cortex-M33 */

/* GPIO_AD_15 (coord N16), SD1_CD_B */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_CD_B_PERIPHERAL                           RGPIO4   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_CD_B_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_CD_B_CHANNEL                                 15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITUSDHCPINS_SD1_CD_B_GPIO                                 RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD1_CD_B_GPIO_PIN                                15U   /*!< GPIO pin number */
#define BOARD_INITUSDHCPINS_SD1_CD_B_GPIO_PIN_MASK                   (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_AD_14 (coord N14), SD_PWREN_B */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD_PWREN_B_PERIPHERAL                         RGPIO4   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD_PWREN_B_SIGNAL                            gpio_io   /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD_PWREN_B_CHANNEL                               14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITUSDHCPINS_SD_PWREN_B_GPIO                               RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD_PWREN_B_GPIO_PIN                              14U   /*!< GPIO pin number */
#define BOARD_INITUSDHCPINS_SD_PWREN_B_GPIO_PIN_MASK                 (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_AD_29 (coord L15), SD1_VSELECT */
/* Routed pin properties */
#define BOARD_INITUSDHCPINS_SD1_VSELECT_PERIPHERAL                        RGPIO4   /*!< Peripheral name */
#define BOARD_INITUSDHCPINS_SD1_VSELECT_SIGNAL                           gpio_io   /*!< Signal name */
#define BOARD_INITUSDHCPINS_SD1_VSELECT_CHANNEL                              29U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITUSDHCPINS_SD1_VSELECT_GPIO                              RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITUSDHCPINS_SD1_VSELECT_GPIO_PIN                             29U   /*!< GPIO pin number */
#define BOARD_INITUSDHCPINS_SD1_VSELECT_GPIO_PIN_MASK                (1U << 29U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSDHCPins(void);               /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPIPins(void);                 /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCodecPins(void);               /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
